import { createStore } from 'vuex'
// images
import study1 from "@/assets/images/study1.png";
import study2 from "@/assets/images/study2.png";
import study3 from "@/assets/images/study3.png";
import news1 from "@/assets/images/news1.png";
import news2 from "@/assets/images/news2.png";
import news3 from "@/assets/images/news3.png";
import gl1 from "@/assets/images/gl1.png";
import gl2 from "@/assets/images/gl2.png";
import gl3 from "@/assets/images/gl3.png";
import gl4 from "@/assets/images/gl4.png";
import gl5 from "@/assets/images/gl5.png";
import gl6 from "@/assets/images/gl6.png";
import gl7 from "@/assets/images/gl7.png";
import gl8 from "@/assets/images/gl8.png";
import gl9 from "@/assets/images/gl9.png";

export default createStore({
  state: {
    contactList: [
      {
        id: 1,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Қарши шаҳри',
        name: 'Узаков Дилшод Серабович',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/1'
      },
      {
        id: 2,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Ғузор тумани',
        name: 'Ташпулатов Шербек Рузикулович',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/2'
      },
      {
        id: 3,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Шаҳрисабз шаҳри',
        name: 'Примов Обиджон Одилович',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/3'
      },
      {
        id: 4,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Деҳқонобод тумани',
        name: 'Рахмонов Жахонгир Улашевич',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/4'
      },
      {
        id: 5,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Қарши шаҳри',
        name: 'Узаков Дилшод Серабович',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/5'
      },
      {
        id: 6,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Ғузор тумани',
        name: 'Ташпулатов Шербек Рузикулович',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/6'
      },
      {
        id: 7,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Ғузор тумани',
        name: 'Ташпулатов Шербек Рузикулович',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/7'
      },
      {
        id: 8,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: 'Шаҳрисабз шаҳри',
        name: 'Примов Обиджон Одилович',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/8'
      },
      {
        id: 9,
        img: 'https://nasafnews.uz/wp-content/uploads/2020/03/photo_2020-01-05_12-47-13-2.jpg',
        title: '“ишга марҳамат” мономаркази',
        name: 'Рахмонов Жахонгир Улашевич',
        address: 'Қашқадарё вилояти, Қарши шаҳри, Хонобод кўчаси, 46 уй',
        tel: '+99893 900-80-09',
        route: '/xududiy-bolimlar/9'
      },
    ],
    studyList: [
      {
        id: 1,
        img: study1,
        title: 'Қарши “Ишга Марҳамат” Мономаркази',
        name: 'Қўзиев Азим Абдуллаевич',
        address: 'Қашқадарё вилояти Дехқонобод тумани Нодира МФЙ Фурқат кўчаси 1-уй',
        tel: '+99875 612-16-25',
        desc: 'Деҳқонобод касб-ҳунарга ўқитиш маркази Директори'
      },
      {
        id: 2,
        img: study2,
        title: 'Шаҳрисабз касб-ҳунарга ўқитиш маркази (KOICA)',
        name: 'Қўзиев Азим Абдуллаевич',
        address: 'Қашқадарё вилояти Дехқонобод тумани Нодира МФЙ Фурқат кўчаси 1-уй',
        tel: '+99875 612-16-25',
        desc: 'Деҳқонобод касб-ҳунарга ўқитиш маркази Директори'
      },
      {
        id: 3,
        img: study3,
        title: 'Деҳқонобод тумани касб-ҳунарга ўқитиш маркази',
        name: 'Қўзиев Азим Абдуллаевич',
        address: 'Қашқадарё вилояти Дехқонобод тумани Нодира МФЙ Фурқат кўчаси 1-уй',
        tel: '+99875 612-16-25',
        desc: 'Деҳқонобод касб-ҳунарга ўқитиш маркази Директори'
      },
    ],
    openSource: [
      {
        id: 1,
        desc: 'Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.',
        time: '20-12-2021',
      },
      {
        id: 2,
        desc: 'Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.',
        time: '21-12-2021',
      },
      {
        id: 3,
        desc: 'Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.',
        time: '22-12-2021',
      },
      {
        id: 4,
        desc: 'Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.',
        time: '23-12-2021',
      },
    ],
    newsList: [
      {
        id: 1,
        img: news1,
        title: '“Тошкент вилояти прокуратураси ҳовлисида фаввора қурган ишчилар пулини ололмаяпти” мазмунидаги хабар юзасидан расмий муносабат',
        desc: 'Вазирлик фаолияти Ўзбекистон Республикаси Конституцияси, қонунлари, Ўзбекистон Республикаси Олий Мажлисининг бошқа расмий ҳужжатлари, Ўзбекистон Республикаси Президентининг буйруқ ва фармойишлари, Вазирлар Маҳкамасининг қарор ва буйруқлари, шунингдек бошқа қонуний ҳужжатлар, Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.',
        time: '20-12-2021',
      },
      {
        id: 2,
        img: news2,
        title: '“Тошкент вилояти прокуратураси ҳовлисида фаввора қурган ишчилар пулини ололмаяпти” мазмунидаги хабар юзасидан расмий муносабат',
        desc: 'Вазирлик фаолияти Ўзбекистон Республикаси Конституцияси, қонунлари, Ўзбекистон Республикаси Олий Мажлисининг бошқа расмий ҳужжатлари, Ўзбекистон Республикаси Президентининг буйруқ ва фармойишлари, Вазирлар Маҳкамасининг қарор ва буйруқлари, шунингдек бошқа қонуний ҳужжатлар, Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.',
        time: '22-12-2021',
      },
      {
        id: 3,
        img: news3,
        title: '“Тошкент вилояти прокуратураси ҳовлисида фаввора қурган ишчилар пулини ололмаяпти” мазмунидаги хабар юзасидан расмий муносабат',
        desc: 'Вазирлик фаолияти Ўзбекистон Республикаси Конституцияси, қонунлари, Ўзбекистон Республикаси Олий Мажлисининг бошқа расмий ҳужжатлари, Ўзбекистон Республикаси Президентининг буйруқ ва фармойишлари, Вазирлар Маҳкамасининг қарор ва буйруқлари, шунингдек бошқа қонуний ҳужжатлар, Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.',
        time: '23-12-2021',
      },
    ],
    galleryList: [
      {
        id: 1,
        img: gl1,
        time: '20-12-2021'
      },
      {
        id: 2,
        img: gl2,
        time: '20-12-2021'
      },
      {
        id: 3,
        img: gl3,
        time: '20-12-2021'
      },
      {
        id: 4,
        img: gl4,
        time: '20-12-2021'
      },
      {
        id: 5,
        img: gl5,
        time: '20-12-2021'
      },
      {
        id: 6,
        img: gl6,
        time: '20-12-2021'
      },
      {
        id: 7,
        img: gl7,
        time: '20-12-2021'
      },
      {
        id: 8,
        img: gl8,
        time: '20-12-2021'
      },
      {
        id: 9,
        img: gl9,
        time: '20-12-2021'
      },
    ]
  },
  getters: {
  },
  mutations: {
  },
  actions: {
  },
  modules: {
  }
})
