<template>
  <div class="boshqarma">
    <MyImg>фаолият йўналишлари</MyImg>
    <div class="boshqarma__container container">
      <div class="boshqarma__inner">
        <p class="idxududiy__desc">Ўзбекистон Республикаси Соғлиқни сақлаш вазирлиги (кейинчалик матнда Вазирлик) соғлиқни сақлаш бўйича марказий давлат бошқаруви ҳисобланиб, ўз фаолияти бўйича Ўзбекистон Республикаси Вазирлар Маҳкамасига бўйсунади. Вазирлик фаолиятини бошқа давлат идоралари, жумладан давлат муассасалари, Қорақалпоғистон Республикаси, вилоятлар ва Тошкент шаҳрининг ижро этувчи ҳокимият идоралари, шунингдек бошқа жамоатчилик ташкилотлари билан бирга олиб боради.</p>
        <p class="idxududiy__desc">Вазирлик фаолияти Ўзбекистон Республикаси Конституцияси, қонунлари, Ўзбекистон Республикаси Олий Мажлисининг бошқа расмий ҳужжатлари, Ўзбекистон Республикаси Президентининг буйруқ ва фармойишлари, Вазирлар Маҳкамасининг қарор ва буйруқлари, шунингдек бошқа қонуний ҳужжатлар, Ўзбекистон Республикаси билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек ушбу Низом асосида юритилади.</p>
      </div>
    </div>
  </div>
</template>

<script>
import MyImg from "@/components/UI/MyImg";
import MyButton from "@/components/UI/MyButton";
export default {
  components: {MyButton, MyImg}
}
</script>

<style lang="scss">

.boshqarma {

  &__inner {
    padding: 50px 0;
  }

  &__desc {
    margin-bottom: 40px;
  }
}

</style>